---
kind: other
id: Methods.T:Autodesk.Revit.DB.Macros.DocumentEntryPoint
source: html/51154515-d384-698e-6f1d-b67a38d7ad1a.htm
---
# DocumentEntryPoint Methods

Acquires coordinates from the specified link instance.